#
# Auto-generated using `brew bundle --dump --describe`.
#
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "minio/stable"
tap "planetscale/tap"
tap "zero-sh/tap"
tap "stardog-union/tap"
tap "cloudflare/cloudflare"
tap "minio/stable"
tap "superfly/tap"

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# Reimplementation of ctags(1)
brew "ctags"

# Tool for managing dock items
brew "dockutil"

# Select default apps for documents and URL schemes on macOS
brew "duti"

# Maintain consistent coding style between multiple editors
brew "editorconfig"

# Functional programming language for building browser-based GUIs
brew "elm"

# Elm source code formatter, inspired by gofmt
brew "elm-format"

# Modern replacement for 'ls'
brew "exa"

# Simple, fast and user-friendly alternative to find
brew "fd"

# Command-line fuzzy finder written in Go
brew "fzf"

# Distributed revision control system
brew "git"

# Syntax-highlighting pager for git and diff output
brew "git-delta"

# Source code tag system
brew "global"

# OpenGL and OpenGL ES reference compiler for shading languages
brew "glslang"

# Terminal interface for viewing git repositories
brew "grv"

# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"

# Mac App Store command-line interface
brew "mas"

# Remote terminal application
brew "mosh"

# Swiss-army knife of markup format conversion
brew "pandoc"


# Search PDFs for strings matching a regular expression
brew "pdfgrep"

# File browser
brew "ranger"

# All-in-one language version manager
brew "asdf"

brew "gpg" 
brew "gawk"

# Tools for file renaming
brew "renameutils"

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"

# Intuitive find & replace CLI
brew "sd"

# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"

# Autoformat shell script source code
brew "shfmt"

# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"


# Very fast implementation of tldr in Rust
brew "tealdeer"

# Terminal multiplexer
brew "tmux"

# Language for application scale JavaScript development
brew "typescript"

# Internet file retriever
brew "wget"

brew "httpie"

brew "hub"

brew "poetry"

brew "pulumi"

brew "minio/stable/mc"
brew "superfly/tap/flyctl"

# Small tool to set macOS user defaults from a YAML file
brew "zero-sh/tap/apply-user-defaults"

# Radically simple personal bootstrapping tool for macOS
brew "zero-sh/tap/zero"

cask "1password"
cask "1password-cli"
cask "chromium"
cask "dash"
cask "discord"
cask "firefox"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "imageoptim"
cask "lastpass"
cask "superhuman"
cask "docker"
cask "beeper"
cask "messenger"
cask "telegram"
cask "whatsapp"
cask "tripmode"
cask "spotify"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "macfuse"
cask "hyper"
cask "figma"
cask "around"
cask "setapp"
cask "raindropio"
cask "mochi"
cask "swish"



mas "Affinity Designer", id: 824171161
mas "Craft", id: 1487937127
mas "Darkroom", id: 953286746
mas "Ebook Converter", id: 1081457679
mas "FastVPN", id: 1419729466
mas "GarageBand", id: 682658836
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Kindle", id: 405399194
mas "LanguageTool", id: 1534275760
mas "Messer", id: 1586304988
mas "NextDNS", id: 1464122853
mas "Plash", id: 1494023538
mas "Tailscale", id: 1475387142
mas "Unsplash Wallpapers", id: 1284863847
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
mas "1Password for Safari", id: 1569813296
mas "Refined Github", id:1519867270
mas "Save to Raindrop.io", id: 1549370672
